{
  "title": "Jennifer",
  "purpose": "growth",
  "pacing": "steady",
  "location": "exterior",
  "timeOfDay": "day",
  "characters": [
    "Jared",
    "Steve"
  ],
  "setting": "Lone_Star_Diner",
  "summary": "connection\r\n",
  "beats": [
    {
      "summary": "Steve and Jared are sitting in his car in the Lone Star parking lot, window up, ac on.  not driving just sitting in the car talking.  Steve is in the passenger seat.  she is jokingly talking about needing to get out of this small town, if you could even call it that.  Jared is watching her, enjoying here animated way of speaking.",
      "wordCount": 300
    },
    {
      "summary": "\"lets go\", jared says...steve chuckles...yeah right, she answers.. how could she just pick up and go...where would she go?  she jabs jared in the ribs...fuck you, dude.  cant you just let a girl ramble.  jared laughs.  a song comes on the radio...a punk rock song.  Steve's eyes widen...i love this song!  she reaches over and turns the volume up.",
      "wordCount": 300
    },
    {
      "summary": "steve begins to dance, or at least as much as she can while sitting in the passenger seat.  she is thrilled.  jared watches, mesmerized.  she really is amazing.  steve works her arms, trying to draw jared in...he laughs...makes some subtle movements to participate, and then waves her off.",
      "wordCount": 300
    },
    {
      "summary": "the song ends.. jared turns the volume down.  you know what, steve says...her voice softens.  i have a confession to make.  jared looks at her, inquisitively.  im listening.  well...you know this nametag, she point to her \"steve\" nametag.  well...its not me.  she explains to jared how Steve was actually a former diner employee.  how she used his name to have some emotional separation from customers, to avoid giving her real name.  stupid, right.  jared just listens.  after a beat, she continues.  my real name is Jennifer.",
      "wordCount": 300
    },
    {
      "summary": "jared looks at her...she shifts in her seat..embarrassed and slightly ashamed.  jared comforts her.  ",
      "wordCount": 300
    }
  ]
}